In [1]:
import pandas as pd

# Series

In [2]:
data = [1,2,3,4,5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
index = ['Linha' + str(i) for i in range(5)]

In [7]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [10]:
s = pd.Series(data = data, index = index)

In [11]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [12]:
data = {'Linha' + str(i): i + 1 for i in range(5)}

In [13]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [14]:
s = pd.Series(data)

In [15]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [16]:
s1 = s + 2

In [17]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [18]:
s2 = s + s1

In [19]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrame

In [20]:
data = [[1,2,3],
        [4,5,6],
        [7,8,9]]

In [21]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [22]:
df1 = pd.DataFrame(data)

In [23]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [34]:
index = ['Linha '+ str(i) for i in range(3)]

In [35]:
index

['Linha 0', 'Linha 1', 'Linha 2']

In [36]:
df1 = pd.DataFrame(data = data, index = index)

In [37]:
df1

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [38]:
columns = ['Coluna '+ str(i) for i in range(3)]

In [39]:
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [40]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [41]:
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [43]:
data = {'Coluna 0':{'Linha 0':1,'Linha 1':4,'Linha 2':7},
        'Coluna 1':{'Linha 0':2,'Linha 1':5,'Linha 2':8},
        'Coluna 2':{'Linha 0':3,'Linha 1':6,'Linha 2':9}}

In [44]:
data

{'Coluna 0': {'Linha 0': 1, 'Linha 1': 4, 'Linha 2': 7},
 'Coluna 1': {'Linha 0': 2, 'Linha 1': 5, 'Linha 2': 8},
 'Coluna 2': {'Linha 0': 3, 'Linha 1': 6, 'Linha 2': 9}}

In [47]:
df2 = pd.DataFrame(data)

In [48]:
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [49]:
data = ((1,2,3),
        (4,5,6),
        (7,8,9))

In [50]:
data

((1, 2, 3), (4, 5, 6), (7, 8, 9))

In [51]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [52]:
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [53]:
df1[df1 > 0] = 'A'

In [54]:
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [55]:
df2[df2 > 0] = 'B'

In [56]:
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [57]:
df3[df3 > 0] = 'C'

In [58]:
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [59]:
df4 = pd.concat([df1,df2,df3])

In [60]:
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [61]:
df4 = pd.concat([df1,df2,df3], axis = 1)

In [62]:
df4

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C

In [63]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [64]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4